balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F87J90.PIC
        <edc:JoinedSFRDef edc:cname="CCPR1" edc:desc="" edc:name="CCPR1" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR1L" edc:desc="" edc:mask="0xff" edc:name="CCPR1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR1H" edc:desc="" edc:mask="0xff" edc:name="CCPR1H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA5" edc:desc="" edc:mask="0xff" edc:name="LCDDATA5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S40C0" edc:desc="" edc:mask="0x1" edc:name="S40C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C0" edc:desc="" edc:mask="0x1" edc:name="S41C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C0" edc:desc="" edc:mask="0x1" edc:name="S42C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C0" edc:desc="" edc:mask="0x1" edc:name="S43C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C0" edc:desc="" edc:mask="0x1" edc:name="S44C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C0" edc:desc="" edc:mask="0x1" edc:name="S45C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C0" edc:desc="" edc:mask="0x1" edc:name="S46C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C0" edc:desc="" edc:mask="0x1" edc:name="S47C0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG40COM0" edc:desc="" edc:mask="0x1" edc:name="SEG40COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG41COM0" edc:desc="" edc:mask="0x1" edc:name="SEG41COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG42COM0" edc:desc="" edc:mask="0x1" edc:name="SEG42COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG43COM0" edc:desc="" edc:mask="0x1" edc:name="SEG43COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG44COM0" edc:desc="" edc:mask="0x1" edc:name="SEG44COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG45COM0" edc:desc="" edc:mask="0x1" edc:name="SEG45COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG46COM0" edc:desc="" edc:mask="0x1" edc:name="SEG46COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG47COM0" edc:desc="" edc:mask="0x1" edc:name="SEG47COM0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA6" edc:desc="" edc:mask="0xff" edc:name="LCDDATA6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S00C1" edc:desc="" edc:mask="0x1" edc:name="S00C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C1" edc:desc="" edc:mask="0x1" edc:name="S01C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C1" edc:desc="" edc:mask="0x1" edc:name="S02C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C1" edc:desc="" edc:mask="0x1" edc:name="S03C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C1" edc:desc="" edc:mask="0x1" edc:name="S04C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C1" edc:desc="" edc:mask="0x1" edc:name="S05C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C1" edc:desc="" edc:mask="0x1" edc:name="S06C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C1" edc:desc="" edc:mask="0x1" edc:name="S07C1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG0COM1" edc:desc="" edc:mask="0x1" edc:name="SEG0COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM1" edc:desc="" edc:mask="0x1" edc:name="SEG1COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM1" edc:desc="" edc:mask="0x1" edc:name="SEG2COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM1" edc:desc="" edc:mask="0x1" edc:name="SEG3COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM1" edc:desc="" edc:mask="0x1" edc:name="SEG4COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM1" edc:desc="" edc:mask="0x1" edc:name="SEG5COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM1" edc:desc="" edc:mask="0x1" edc:name="SEG6COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM1" edc:desc="" edc:mask="0x1" edc:name="SEG7COM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S0C1" edc:desc="" edc:mask="0x1" edc:name="S0C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S1C1" edc:desc="" edc:mask="0x1" edc:name="S1C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S2C1" edc:desc="" edc:mask="0x1" edc:name="S2C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S3C1" edc:desc="" edc:mask="0x1" edc:name="S3C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S4C1" edc:desc="" edc:mask="0x1" edc:name="S4C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S5C1" edc:desc="" edc:mask="0x1" edc:name="S5C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S6C1" edc:desc="" edc:mask="0x1" edc:name="S6C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S7C1" edc:desc="" edc:mask="0x1" edc:name="S7C1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA7" edc:desc="" edc:mask="0xff" edc:name="LCDDATA7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S8C1" edc:desc="" edc:mask="0x1" edc:name="S8C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S9C1" edc:desc="" edc:mask="0x1" edc:name="S9C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C1" edc:desc="" edc:mask="0x1" edc:name="S10C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C1" edc:desc="" edc:mask="0x1" edc:name="S11C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C1" edc:desc="" edc:mask="0x1" edc:name="S12C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C1" edc:desc="" edc:mask="0x1" edc:name="S13C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C1" edc:desc="" edc:mask="0x1" edc:name="S14C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C1" edc:desc="" edc:mask="0x1" edc:name="S15C1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG8COM1" edc:desc="" edc:mask="0x1" edc:name="SEG8COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM1" edc:desc="" edc:mask="0x1" edc:name="SEG9COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM1" edc:desc="" edc:mask="0x1" edc:name="SEG10COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM1" edc:desc="" edc:mask="0x1" edc:name="SEG11COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM1" edc:desc="" edc:mask="0x1" edc:name="SEG12COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM1" edc:desc="" edc:mask="0x1" edc:name="SEG13COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM1" edc:desc="" edc:mask="0x1" edc:name="SEG14COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM1" edc:desc="" edc:mask="0x1" edc:name="SEG15COM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S08C1" edc:desc="" edc:mask="0x1" edc:name="S08C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C1" edc:desc="" edc:mask="0x1" edc:name="S09C1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA8" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA8" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA8" edc:desc="" edc:mask="0xff" edc:name="LCDDATA8" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S16C1" edc:desc="" edc:mask="0x1" edc:name="S16C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C1" edc:desc="" edc:mask="0x1" edc:name="S17C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C1" edc:desc="" edc:mask="0x1" edc:name="S18C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C1" edc:desc="" edc:mask="0x1" edc:name="S19C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C1" edc:desc="" edc:mask="0x1" edc:name="S20C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C1" edc:desc="" edc:mask="0x1" edc:name="S21C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C1" edc:desc="" edc:mask="0x1" edc:name="S22C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C1" edc:desc="" edc:mask="0x1" edc:name="S23C1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG16COM1" edc:desc="" edc:mask="0x1" edc:name="SEG16COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM1" edc:desc="" edc:mask="0x1" edc:name="SEG17COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM1" edc:desc="" edc:mask="0x1" edc:name="SEG18COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM1" edc:desc="" edc:mask="0x1" edc:name="SEG19COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM1" edc:desc="" edc:mask="0x1" edc:name="SEG20COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM1" edc:desc="" edc:mask="0x1" edc:name="SEG21COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM1" edc:desc="" edc:mask="0x1" edc:name="SEG22COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM1" edc:desc="" edc:mask="0x1" edc:name="SEG23COM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA9" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA9" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA9" edc:desc="" edc:mask="0xff" edc:name="LCDDATA9" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S24C1" edc:desc="" edc:mask="0x1" edc:name="S24C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C1" edc:desc="" edc:mask="0x1" edc:name="S25C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C1" edc:desc="" edc:mask="0x1" edc:name="S26C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C1" edc:desc="" edc:mask="0x1" edc:name="S27C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C1" edc:desc="" edc:mask="0x1" edc:name="S28C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C1" edc:desc="" edc:mask="0x1" edc:name="S29C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C1" edc:desc="" edc:mask="0x1" edc:name="S30C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C1" edc:desc="" edc:mask="0x1" edc:name="S31C1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG24COM1" edc:desc="" edc:mask="0x1" edc:name="SEG24COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM1" edc:desc="" edc:mask="0x1" edc:name="SEG25COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM1" edc:desc="" edc:mask="0x1" edc:name="SEG26COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM1" edc:desc="" edc:mask="0x1" edc:name="SEG27COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM1" edc:desc="" edc:mask="0x1" edc:name="SEG28COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM1" edc:desc="" edc:mask="0x1" edc:name="SEG29COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM1" edc:desc="" edc:mask="0x1" edc:name="SEG30COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM1" edc:desc="" edc:mask="0x1" edc:name="SEG31COM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
